[
{"title": "Halifax Police investigate sudden death inside Walmart, company ‘heartbroken’", "description": "\n\t\t\t\t\t\tHalifax Regional Police are investigating a sudden death at a Walmart on Mumford Road in the city's west end. Few details have so far been provided. \t\t\t\t\t\t"},
{"title": "Elon Musk offers $1M giveaway for swing state voters who sign PAC petition", "description": "\n\t\t\t\t\t\tElon Musk is raising eyebrows - and questions about U.S. election law - with a new stunt: He's promising to give $1 million to random swing state voters who sign his new petition.\t\t\t\t\t\t"},
{"title": "At least 7 dead, 6 critically injured after ferry dock collapses in Georgia", "description": "\n\t\t\t\t\t\tOfficials say upwards of 40 people were on the gangway when the “catastrophic failure” occurred, and at least 20 people fell into the water.\t\t\t\t\t\t"},
{"title": "Are we entering a new analogue age? Gen Z is leading us there", "description": "\n\t\t\t\t\t\tFor decades, we've lived in a digital world. Now gen Z is reversing that.\t\t\t\t\t\t"},
{"title": "B.C. Election: What the party leaders said as votes continue to be counted", "description": "\n\t\t\t\t\t\tThe outcome of British Columbia's election remains unclear after a close race between the NDP and the B.C. Conservatives. Vote counting will continue Sunday.\t\t\t\t\t\t"},
{"title": "Hurricane Oscar makes landfall in the Bahamas, heads for Cuba", "description": "\n\t\t\t\t\t\tHurricane Oscar made landfall early Sunday in the southeastern Bahamas and was heading toward Cuba, an island recently beleaguered by a massive power outage.\t\t\t\t\t\t"},
{"title": "Liberals unhappy with Trudeau ‘don’t have another choice’: ex-BQ leader", "description": "\n\t\t\t\t\t\tGilles Duceppe said no one is running to replace Justin Trudeau as leader of the beleaguered Liberal party 'because they know they will lose'\t\t\t\t\t\t"},
{"title": "Bishnoi gang has stoked fear in Canada for years, says B.C. city councillor", "description": "\n\t\t\t\t\t\tFear of the Bishnoi gang and its leader has permeated Canada's South Asian diaspora for years, says a city councillor in Richmond, B.C.\t\t\t\t\t\t"}
]